## Importing the importing libraries

In [41]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [42]:
df1 = pd.read_csv("data/2013(June)-2021(May).csv")
df2 = pd.read_csv("data/may-2021-to-september-2023.csv", header=None)

In [43]:
df1.columns

Index(['SN', 'Commodity', 'Date', 'Unit', 'Minimum', 'Maximum', 'Average'], dtype='object')

In [44]:
df1.head()

   SN            Commodity        Date Unit  Minimum  Maximum  Average
0   0   Tomato Big(Nepali)  2013-06-16   Kg     35.0     40.0     37.5
1   1  Tomato Small(Local)  2013-06-16   Kg     26.0     32.0     29.0
2   2           Potato Red  2013-06-16   Kg     20.0     21.0     20.5
3   3         Potato White  2013-06-16   Kg     15.0     16.0     15.5
4   4   Onion Dry (Indian)  2013-06-16   Kg     28.0     30.0     29.0

In [45]:
del df1['SN']

In [46]:
df1.columns

Index(['Commodity', 'Date', 'Unit', 'Minimum', 'Maximum', 'Average'], dtype='object')

In [47]:
df2.columns = df1.columns

## TASK 1: Combine two dataframes top and bottom

In [48]:
df3 = pd.concat([df1,df2])

In [49]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 197161 entries, 0 to 197160
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Commodity  197161 non-null  object
 1   Date       197161 non-null  object
 2   Unit       197161 non-null  object
 3   Minimum    197161 non-null  float64
 4   Maximum    197161 non-null  float64
 5   Average    197161 non-null  float64
dtypes: float64(3), object(3)
memory usage: 9.0+ MB

In [50]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 96480 entries, 0 to 96479
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Commodity  96480 non-null  object
 1   Date       96480 non-null  object
 2   Unit       96480 non-null  object
 3   Minimum    96480 non-null  object
 4   Maximum    96480 non-null  object
 5   Average    96480 non-null  object
dtypes: object(6)
memory usage: 4.4+ MB

In [51]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 293641 entries, 0 to 96479
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Commodity  293641 non-null  object
 1   Date       293641 non-null  object
 2   Unit       293641 non-null  object
 3   Minimum    293641 non-null  object
 4   Maximum    293641 non-null  object
 5   Average    293641 non-null  object
dtypes: object(6)
memory usage: 15.7+ MB

## TASK 2: Convert the Date column to Date types

In [11]:
len(df1['Commodity'].unique())

132

In [13]:
len(df2['Tomato Big(Nepali)'].unique())

133

In [16]:
df1['Commodity'].value_counts()

Commodity
Ginger                  2751
Cauli Local             2750
Cabbage(Local)          2749
Chilli Dry              2748
Raddish White(Local)    2747
                        ...
Maize                     24
Mango(Calcutte)           23
Sweet Lime                14
Musk Melon                10
Mango(Chousa)              2
Name: count, Length: 132, dtype: int64

## TASK 3: I think there are repeated values in the Commdity fields. I might need to make a table for repeated things.

In [19]:
df1['Unit'].value_counts()

Unit
Kg      184408
KG        6889
1 Pc      3120
Doz       2744
Name: count, dtype: int64

In [ ]:
df1['Unit'].value_counts()

## TASK 4: Hey Nabin, Give a proper namings to the df2's column, Okaaaaaay?

## TASK 5: Understand the meaning of the max, min, and average or if needed make something different.

## TASK 6: Make sure to check the Data Value constraints

# Let's Start

In [52]:
df3

                  Commodity        Date Unit   Minimum   Maximum   Average
0        Tomato Big(Nepali)  2013-06-16   Kg      35.0      40.0      37.5
1       Tomato Small(Local)  2013-06-16   Kg      26.0      32.0      29.0
2                Potato Red  2013-06-16   Kg      20.0      21.0      20.5
3              Potato White  2013-06-16   Kg      15.0      16.0      15.5
4        Onion Dry (Indian)  2013-06-16   Kg      28.0      30.0      29.0
...                     ...         ...  ...       ...       ...       ...
96475  Tomato Small(Indian)  2023-09-28   KG  Rs 45.00  Rs 55.00  Rs 50.00
96476   Tomato Small(Local)  2023-09-28   KG  Rs 50.00  Rs 60.00  Rs 55.00
96477  Tomato Small(Tunnel)  2023-09-28   KG  Rs 60.00  Rs 75.00  Rs 69.00
96478              Turnip A  2023-09-28   KG  Rs 70.00  Rs 80.00  Rs 75.00
96479    Water Melon(Green)  2023-09-28   KG  Rs 50.00  Rs 60.00  Rs 56.67

[293641 rows x 6 columns]

# TASK: Removing the RS

In [56]:
df3['Minimum'] = df3['Minimum'].apply(lambda x: float(x.replace('Rs', '').strip()) if isinstance(x, str) and 'Rs' in x else float(x))

In [57]:
df3['Maximum'] = df3['Maximum'].apply(lambda x: float(x.replace('Rs', '').strip()) if isinstance(x, str) and 'Rs' in x else float(x))

In [58]:
df3['Average'] = df3['Average'].apply(lambda x: float(x.replace('Rs', '').strip()) if isinstance(x, str) and 'Rs' in x else float(x))

In [60]:
df3.head()

             Commodity        Date Unit  Minimum  Maximum  Average
0   Tomato Big(Nepali)  2013-06-16   Kg     35.0     40.0     37.5
1  Tomato Small(Local)  2013-06-16   Kg     26.0     32.0     29.0
2           Potato Red  2013-06-16   Kg     20.0     21.0     20.5
3         Potato White  2013-06-16   Kg     15.0     16.0     15.5
4   Onion Dry (Indian)  2013-06-16   Kg     28.0     30.0     29.0

# Let's touch the Date

In [65]:
df3['Date']

0        2013-06-16
1        2013-06-16
2        2013-06-16
3        2013-06-16
4        2013-06-16
            ...
96475    2023-09-28
96476    2023-09-28
96477    2023-09-28
96478    2023-09-28
96479    2023-09-28
Name: Date, Length: 293641, dtype: object

In [67]:
dir(pd)

['ArrowDtype',
 'BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_built_with_meson',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_pandas_datetime_CAPI',
 '_pandas_parser_CAPI',
 '_testing',
 '_typing',
 '_version_meson',
 'annotations',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'from_dummies',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [74]:
df3['Date'] = pd.to_datetime(df3['Date'],format='mixed')

In [77]:
print("min: ",df3['Date'].min(), "\nmax: ",df3['Date'].max())

min:  2013-06-16 00:00:00
max:  2023-09-28 00:00:00